/*
Даты перехода на лето с 2000 года по 2027. далее цикл повторяется
март.
26,25,31,30,28,27,26,25,30,29, // 2000-2009
28,27,25,31,30,29,27,26,25,31, // 2010-2019
29,28,27,26,31,30,29,28        // 2020-2027

Даты перехода на зиму в октябре:
теже самые только эта таблица  начинается для октября с 2008 года по 2035. 
Соответственно цикл теже 28 лет.
Т.е. для годов с 2000 по 2007 эта таблица берется с конца, последние 8 значений
29,28,27,26,31,30,29,28
 0  1  2  3  4  5  6  7

struct struct_date
{
    char day;
    char month;
    short year;
};
 
int what_day(const struct struct_date * const date)
{
    int a = (14 - date->month) / 12;
    int y = date->year - a;
    int m = date->month + 12 * a - 2;
    return (7000 + (date->day + y + y / 4 - y / 100 + y / 400 + (31 * m) / 12)) % 7;


*/
//количество дней в месяцах - обычный год
const unsigned char DinMn[12] = {31,28,31,30,31,30,31,31,30,31,30,31};
//количество дней в месяцах - высокосный год
const unsigned char DinMv[12] = {31,29,31,30,31,30,31,31,30,31,30,31};
volatile unsigned int Year = 0, Month = 0, Day = 0, Hour = 0, Minute = 0, Second = 0;
unsigned int LineTTime;
unsigned int Leto[28] = {2808,2760,2904,2880,2856,2808,2784,2760,2904,2856,2832,2808,2784,
						2904,2880,2856,2832,2784,2760,2904,2880,2832,2808,2784,2928,2880,
						2856,2832};
unsigned int Zima[28] = {8016,7968,7944,7920,8064,8016,7992,7968,7944,7896,8040,8016,7992,
						7944,7920,7896,8040,7992,7968,7944,7920,8040,8016,7992,7968,7920,
						7896,8040};
//-----------------------------------------------------------------------------------------------------------------------
unsigned char IsBissextile(unsigned short Year)                                            //определение высокосного года
{
	unsigned char Res;                                            //результат
//Год високосный, если он делится на четыре без остатка
	if((Year % 4) == 0)
		Res = 1;                                      //год высокосный
	else
		Res = 0;                                      //нет
//но если он делится на 100 без остатка, это не високосный год
	if((Year % 100) == 0)
		Res = 0;
//Однако, если он делится без остатка на 400, это високосный год
//Таким образом, 2000 г. является особым високосным годом, который бывает лишь раз в 400 лет
	if((Year % 400) == 0)
		Res = 1;
	return Res;                                                   //результат
}
//-----------------------------------------------------------------------------------------------------------------------
void TTime()                                                //преобразование даты в линейные часы от начала года
{
	unsigned int i;                                       //индекс
	LineTTime = 0;                                               //сброс линейного времени
	for(i = 0; i <= Month; i++)                                //пробежка по месяцам
	{
		if(IsBissextile((unsigned short)Year + 2000))
			LineTTime += (unsigned int)DinMv[i] * 24; //высокосные года
		else
			LineTTime += (unsigned int)DinMn[i] * 24; //обычные года
	}
//текущее число, часы
	LineTTime += (unsigned int)Day * 24 + Hour; 
}

void CorrTime()
{
	if((LineTTime >= Leto[Year]) && (LineTTime < Zima[Year]))
	{
		Hour = Hour + 3;
	}
	else
		Hour = Hour + 2;
	if(Hour > 23)
	{
		Hour = Hour - 24;
		Day++;
		if(IsBissextile((unsigned short)Year + 2000))
		{
			if(Day > DinMv[Month])
			{
				Day = 0;
				Month++;
				if(Month > 11)
				{
					Month = 0;
					Year++;
				}
			}
		}
		else
		{
			if(Day > DinMn[Month])
			{
				Day = 0;
				Month++;
				if(Month > 11)
				{
					Month = 0;
					Year++;
				}
			}
		}
	}
}

